package cn.gmlee.tools.base.enums;

/**
 * 通用响应码枚举.
 * msg不是必须展示给用户的内容
 * <p>
 * 1000(操作成功): 1001~1999: 意料之中的业务异常, msg应该展示给客户
 * 2000(没有约定): 2001~2999: 约定规则没有执行, msg应该提示给开发者
 * 3000(三方失误): 3001~3999: 开发者失误, 第三方调用错误: 工具、接口等
 * 4000(无理请求): 4001~4999: 无理取闹的请求, 404, 重复攻击等
 * 5000(未知异常): 5001~5999: 意料之外的代码异常, 需要开发者及时修复
 * 6000(通讯异常): 6001~6999: 系统架构中的中间件或者微服务之间无法通讯
 * 7000(中台异常): 7001~7999: 中台架构的专用异常, 比如权限不足、认证失败
 * </p>
 *
 * @author Jas°
 * @date 2020 /9/21 (周一)
 */
public enum XCode {
    // 基本成功
    HTTP_OK(200, "请求成功"),
    // 资源丢失
    HTTP_MISSING(404, "资源丢失"),
    // 系统离线
    HTTP_OFFLINE(502, "系统离线"),

    // 1000: 操作成功, 1001~1999: 等同于1000 + 业务指令(1~999)
    // (比如1001表示: 操作成功, 并且希望调用方执行1号对应的业务处理, 1002~以此类推)
    OK1000(1000, "操作成功"),
    OK_COMMAND_MIN(1001, "最小业务指令"),
    OK_COMMAND_MAX(1999, "最大业务指令"),

    // 2000: 约定失败, 2001: 签名失败, 2002: 用户操作异常(其消息用于提示用户)
    CONSENSUS2000(2000, "约定失败"),
    CONSENSUS_SIGN2001(2001, "签名异常"),
    CONSENSUS_USER2002(2002, "操作异常"),
    // 2010: 约定重试, 2011: 重定向
    CONSENSUS_RETRY2010(2010, "请重试"),
    CONSENSUS_REDIRECT2011(2011, "重定向"),
    CONSENSUS_VC2012(2012, "请重新输入验证码"),

    // 3000: 三方失败
    THIRD_PARTY3000(3000, "请求第三方失败"),

    // 4000: 请求失败, 40003: 状态失效, 4004: 资源丢失(页面,文件,图片等..)
    UNREASONABLE4000(4000, "请求失败"),
    UNREASONABLE_CANCELLED4003(4003, "取消请求"),
    UNREASONABLE_NOT_FOUND4004(4004, "资源丢失"),
    UNREASONABLE_DUPLICATE4005(4005, "资源重复"),
    UNREASONABLE_STATE_FAILURE4006(4006, "状态无效"),

    // 5000: 未知异常, 5001: 服务器时间异常, 5002: 服务器代码异常
    UNKNOWN5000(5000, "未知异常"),
    SERVER_TIME5001(5001, "服务器时间异常"),
    SERVER_CODE5002(5002, "服务器代码异常"),

    // 6000: 通讯异常, 6001: 失败熔断, 60002: 解码异常, 60003: 编码异常
    IM6000(6000, "通讯异常"),
    IM_FUSING6001(6001, "连接断开"),
    IM_DECODE6002(6002, "解码异常"),
    IM_ENCODE6003(6003, "编码异常"),

    // 7000: 服务异常
    SOA7000(7000, "服务异常"),

    // 8000: 账户异常
    ACCOUNT_AUTH7001(8000, "登录超时或未登录"),
    ACCOUNT_INCORRECT7004(8001, "用户名或密码错误"),
    ACCOUNT_CONFINE7003(8002, "已被限制使用"),
    ACCOUNT_PERMISSION7002(8003, "权限不足或未授权"),

    ;

    public final int code;
    public final String msg;

    XCode(int code, String msg) {
        this.code = code;
        this.msg = msg;
    }
}
